Revit 2026 API

# PointCloudInstanceContainsScan Method

---

Identifies whether the instance contains a scan.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool ContainsScan(
	string scanName
)
```
```vb
Public Function ContainsScan (
	scanName As String
) As Boolean
```
```cpp
public:
bool ContainsScan(
	String^ scanName
)
```
```fsharp
member ContainsScan :
        scanName : string -> bool
```

#### Parameters

scanName String
     Name of the scan.

#### Return Value

Boolean

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

PointCloudInstance Class

Autodesk.Revit.DB Namespace